run/tutorials/combustion/buoyantReactingFoam/Lagrangian/splashPanel/Allrun
#!/bin/sh
cd ${0%/*} || exit 1    # Run from this directory

. $WM_PROJECT_DIR/bin/tools/RunFunctions

runApplication blockMesh
runApplication topoSet
runApplication extrudeToRegionMesh -overwrite

paraFoam -touchAll

runApplication $(getApplication)

#------------------------------------------------------------------------------
